---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures
source: html/376f0f4f-e1e0-f704-79cb-4d48ced78602.htm
---
# BuiltInFailures.CurtainWallFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.